// Конкатенация строк
// Напишите функцию, которая принимает две строки и возвращает их конкатенацию.

// package main

// import "fmt"

// func main() {
// 	s1 := "Hello "
// 	s2 := "World"
// 	s3 := s1 + s2
// 	fmt.Println(s3)
// }

//------------------------------------------------------------------------------------

// Длина строки
// Напишите функцию, которая принимает строку и возвращает её длину.

// package main

// import "fmt"

// func S(s string) int {
// 	return len(s)
// }
// func main() {
// 	s := "Aky Shohin"
// 	fmt.Println(S(s))
// }

//-----------------------------------------------------------------------------------